test_result/fio-3.28-4R5J0001-sw-1G-qd64-num1-16K-3000-WT.txt
fio-3.28-4R5J0001-write-1G-64-1-16K: (g=0): rw=write, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685932,
  "timestamp_ms" : 1750685932082,
  "time" : "Mon Jun 23 21:38:52 2025",
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-write-1G-64-1-16K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-write-1G-64-1-16K",
        "filename" : "/dev/sda",
        "rw" : "write",
        "bs" : "16K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "64",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "write" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 1009155849,
        "bw" : 985503,
        "iops" : 61593.984962,
        "runtime" : 1064,
        "total_ios" : 65536,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 2765,
          "max" : 111951,
          "mean" : 7607.258377,
          "stddev" : 1342.080987,
          "N" : 65536
        },
        "clat_ns" : {
          "min" : 279307,
          "max" : 1992966,
          "mean" : 1030120.893875,
          "stddev" : 45476.836273,
          "N" : 65536,
          "percentile" : {
            "1.000000" : 946176,
            "5.000000" : 970752,
            "10.000000" : 995328,
            "20.000000" : 1011712,
            "30.000000" : 1019904,
            "40.000000" : 1028096,
            "50.000000" : 1028096,
            "60.000000" : 1028096,
            "70.000000" : 1036288,
            "80.000000" : 1044480,
            "90.000000" : 1056768,
            "95.000000" : 1089536,
            "99.000000" : 1138688,
            "99.500000" : 1253376,
            "99.900000" : 1433600,
            "99.950000" : 1515520,
            "99.990000" : 1925120
          },
          "bins" : {
            "280576" : 5,
            "284672" : 8,
            "288768" : 5,
            "460800" : 1,
            "485376" : 12,
            "489472" : 3,
            "493568" : 3,
            "651264" : 1,
            "675840" : 1,
            "684032" : 11,
            "782336" : 1,
            "790528" : 3,
            "806912" : 1,
            "815104" : 1,
            "823296" : 1,
            "839680" : 1,
            "847872" : 2,
            "856064" : 2,
            "864256" : 6,
            "872448" : 15,
            "880640" : 4,
            "888832" : 8,
            "897024" : 17,
            "905216" : 48,
            "913408" : 17,
            "921600" : 67,
            "929792" : 148,
            "937984" : 245,
            "946176" : 414,
            "954368" : 567,
            "962560" : 1074,
            "970752" : 1050,
            "978944" : 1243,
            "987136" : 1160,
            "995328" : 1405,
            "1003520" : 2286,
            "1011712" : 4652,
            "1019904" : 9184,
            "1028096" : 17002,
            "1036288" : 10367,
            "1044480" : 4629,
            "1056768" : 3703,
            "1073152" : 2119,
            "1089536" : 1633,
            "1105920" : 856,
            "1122304" : 575,
            "1138688" : 336,
            "1155072" : 129,
            "1171456" : 45,
            "1187840" : 47,
            "1204224" : 30,
            "1220608" : 22,
            "1236992" : 32,
            "1253376" : 15,
            "1269760" : 32,
            "1286144" : 27,
            "1302528" : 23,
            "1318912" : 15,
            "1335296" : 41,
            "1351680" : 21,
            "1368064" : 9,
            "1384448" : 8,
            "1400832" : 39,
            "1417216" : 19,
            "1433600" : 32,
            "1449984" : 18,
            "1466368" : 2,
            "1482752" : 2,
            "1499136" : 3,
            "1515520" : 2,
            "1531904" : 2,
            "1564672" : 2,
            "1597440" : 2,
            "1630208" : 2,
            "1662976" : 2,
            "1695744" : 2,
            "1728512" : 2,
            "1761280" : 2,
            "1794048" : 2,
            "1826816" : 2,
            "1859584" : 2,
            "1892352" : 2,
            "1925120" : 2,
            "1941504" : 1,
            "1957888" : 1,
            "1974272" : 1,
            "1990656" : 2
          }
        },
        "lat_ns" : {
          "min" : 283471,
          "max" : 2001286,
          "mean" : 1037938.996704,
          "stddev" : 45434.607241,
          "N" : 65536
        },
        "bw_min" : 984896,
        "bw_max" : 989280,
        "bw_agg" : 100.000000,
        "bw_mean" : 987088.000000,
        "bw_dev" : 3099.956129,
        "bw_samples" : 2,
        "iops_min" : 61556,
        "iops_max" : 61830,
        "iops_mean" : 61693.000000,
        "iops_stddev" : 193.747258,
        "iops_samples" : 2
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 1063,
      "usr_cpu" : 12.041392,
      "sys_cpu" : 54.938852,
      "ctx" : 20807,
      "majf" : 0,
      "minf" : 10,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 0.100000,
        "16" : 0.100000,
        "32" : 0.100000,
        ">=64" : 99.903870
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.998473,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.100000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.056458,
        "750" : 0.019836,
        "1000" : 11.602783
      },
      "latency_ms" : {
        "2" : 88.320923,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 64,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 46,
      "write_ios" : 54197,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 3,
      "write_ticks" : 55308,
      "in_queue" : 55312,
      "util" : 90.519878
    }
  ]
}

fio-3.28-4R5J0001-write-1G-64-1-16K: (groupid=0, jobs=1): err= 0: pid=84586: Mon Jun 23 21:38:52 2025
  write: IOPS=61.6k, BW=962MiB/s (1009MB/s)(1024MiB/1064msec); 0 zone resets
    slat (usec): min=2, max=111, avg= 7.61, stdev= 1.34
    clat (usec): min=279, max=1992, avg=1030.12, stdev=45.48
     lat (usec): min=283, max=2001, avg=1037.94, stdev=45.43
    clat percentiles (usec):
     |  1.00th=[  947],  5.00th=[  971], 10.00th=[  996], 20.00th=[ 1012],
     | 30.00th=[ 1020], 40.00th=[ 1029], 50.00th=[ 1029], 60.00th=[ 1029],
     | 70.00th=[ 1037], 80.00th=[ 1045], 90.00th=[ 1057], 95.00th=[ 1090],
     | 99.00th=[ 1139], 99.50th=[ 1254], 99.90th=[ 1434], 99.95th=[ 1516],
     | 99.99th=[ 1926]
   bw (  KiB/s): min=984896, max=989280, per=100.00%, avg=987088.00, stdev=3099.96, samples=2
   iops        : min=61556, max=61830, avg=61693.00, stdev=193.75, samples=2
  lat (usec)   : 500=0.06%, 750=0.02%, 1000=11.60%
  lat (msec)   : 2=88.32%
  cpu          : usr=12.04%, sys=54.94%, ctx=20807, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,65536,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=962MiB/s (1009MB/s), 962MiB/s-962MiB/s (1009MB/s-1009MB/s), io=1024MiB (1074MB), run=1064-1064msec

Disk stats (read/write):
  sda: ios=46/54197, merge=0/0, ticks=3/55308, in_queue=55312, util=90.52%